# üîí Port Security Configuration & Testing (Cisco Switch)

This guide helps you configure and verify **Port Security** on Cisco switches to restrict access and protect your network.

---

## ‚úÖ What is Port Security?

Port Security is a feature that allows a switch to **restrict input** to an interface by **limiting and identifying MAC addresses**. It helps prevent unauthorized devices from connecting.

> üîê **‡¶¨‡¶æ‡¶Ç‡¶≤‡¶æ‡ßü**: Port Security ‡¶Æ‡¶æ‡¶®‡ßá ‡¶∏‡ßÅ‡¶á‡¶ö‡ßá ‡¶®‡¶ø‡¶∞‡¶æ‡¶™‡¶§‡ßç‡¶§‡¶æ ‡¶¨‡ßç‡¶Ø‡¶¨‡¶∏‡ßç‡¶•‡¶æ ‡¶ö‡¶æ‡¶≤‡ßÅ ‡¶ï‡¶∞‡¶æ, ‡¶Ø‡¶æ‡¶§‡ßá ‡¶ï‡ßã‡¶®‡ßã **‡¶Ö‡¶®‡¶®‡ßÅ‡¶Æ‡ßã‡¶¶‡¶ø‡¶§ ‡¶°‡¶ø‡¶≠‡¶æ‡¶á‡¶∏** ‡¶∏‡ßÅ‡¶á‡¶ö‡ßá ‡¶∏‡¶Ç‡¶Ø‡ßÅ‡¶ï‡ßç‡¶§ ‡¶π‡¶§‡ßá ‡¶®‡¶æ ‡¶™‡¶æ‡¶∞‡ßá‡•§

---

## üö¶ Port Security Modes

| Mode        | Behavior                                                                 |
|-------------|--------------------------------------------------------------------------|
| `protect`   | Silently drops packets from unknown MAC addresses.                       |
| `restrict`  | Drops packets and logs the violation.                                    |
| `shutdown`  | Disables the port completely upon a violation (default mode).            |

---

## ‚öôÔ∏è Configuration Steps

### 1Ô∏è‚É£ Basic Switch Setup

```bash
Switch> enable
Switch# configure terminal
Switch(config)# hostname S1
S1(config)# interface FastEthernet0/1
S1(config-if)# switchport mode access
S1(config-if)# switchport port-security
```

---

### 2Ô∏è‚É£ Configure Port Security Parameters

```bash
S1(config-if)# switchport port-security maximum 1
S1(config-if)# switchport port-security violation restrict
S1(config-if)# switchport port-security mac-address sticky
S1(config-if)# exit
```

üîé Explanation:
- `maximum 1`: Only 1 MAC address allowed.
- `violation restrict`: Logs and drops packets from unknown MACs.
- `mac-address sticky`: Learns and stores the first MAC address dynamically.

---

### 3Ô∏è‚É£ Assign IP to PC (e.g., PC1)

üñ•Ô∏è Example:
- IP: `192.168.1.10`
- Subnet Mask: `255.255.255.0`
- Gateway: `192.168.1.1`

---

## üîç Verify Configuration

```bash
S1# show port-security
S1# show port-security interface FastEthernet0/1
S1# show mac address-table
S1# show port-security address
```

---

## üß™ Test Port Security

### Scenario:
1. Connect **PC1** to `FastEthernet0/1` ‚Äì connection should work.
2. Replace PC1 with **PC2** (different MAC) ‚Äì port reacts based on violation mode.

### Results Based on Mode:

| Mode        | Behavior When PC2 Connects                        |
|-------------|---------------------------------------------------|
| `protect`   | Drops traffic silently (no log shown).            |
| `restrict`  | Drops traffic + logs violation messages.          |
| `shutdown`  | Port is disabled and goes to `err-disabled`.      |

---

## üìã Check Violation Logs

```bash
S1# show log
```

üîç Look for messages like:
```
%PORT_SECURITY-2-PSECURE_VIOLATION: Security violation occurred...
```

---

## ‚ö†Ô∏è If Port Goes Down (Shutdown Mode)

### Check Port Status

```bash
S1# show interface status
```

You will see the interface in `err-disabled` state.

### Recover from Violation

```bash
S1(config)# interface FastEthernet0/1
S1(config-if)# shutdown
S1(config-if)# no shutdown
```

---

## üí° Summary of Useful Commands

| Command                                  | Description                                 |
|------------------------------------------|---------------------------------------------|
| `show port-security`                     | Displays summary of all secured ports       |
| `show port-security interface fa0/1`     | Detailed info for a specific port           |
| `show mac address-table`                 | Shows MAC address table                     |
| `show port-security address`             | Lists learned MAC addresses per port        |
| `show log`                               | View system logs (includes violations)      |
| `show interface status`                  | Checks interface states                     |

---

## üìå Tips

- Use `restrict` or `protect` in real environments to avoid auto shutdowns.
- Save the config using:
```bash
S1# copy running-config startup-config
```
- Regularly monitor port activity with:
```bash
S1# show port-security
``‚Äå‚Äå‚Äå`