# ğŸ›°ï¸ Static Routing

## ğŸ“Œ Static Routing Between Two Routers

### ğŸ”¹ Steps:
- Basic Configuration
- Assign IP Address to PC (via DHCP)
- Configure Static Routing
- Verify Static Routes

---

## ğŸš¦ Router 0

### ğŸ”§ Basic Configuration:
```bash
Router> enable                 // User EXEC mode
Router# configure terminal     // Privileged EXEC mode
Router(config)# interface gig0/0    // LAN interface
Router(config-if)# ip address 192.168.10.1 255.255.255.0
Router(config-if)# no shutdown

Router(config)# interface se0/1/0    // Serial interface to Router 1
Router(config-if)# ip address 100.10.10.1 255.255.255.0
Router(config-if)# no shutdown
````

### ğŸ–¥ï¸ Assign IP to PC Dynamically (DHCP):

```bash
Router(config)# ip dhcp pool IT
Router(dhcp-config)# network 192.168.10.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.10.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# exit
```

### ğŸ“ Static Routing:

```bash
Router(config)# ip route 192.168.20.0 255.255.255.0 100.10.10.2
```

---

## ğŸš¦ Router 1

### ğŸ”§ Basic Configuration:

```bash
Router> enable
Router# configure terminal
Router(config)# interface gig0/0
Router(config-if)# ip address 192.168.20.1 255.255.255.0
Router(config-if)# no shutdown

Router(config)# interface se0/0/0
Router(config-if)# ip address 100.10.10.2 255.255.255.0
Router(config-if)# no shutdown
```

### ğŸ–¥ï¸ Assign IP to PC Dynamically (DHCP):

```bash
Router(config)# ip dhcp pool Sales
Router(dhcp-config)# network 192.168.20.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.20.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# exit
```

### ğŸ“ Static Routing:

```bash
Router(config)# ip route 192.168.10.0 255.255.255.0 100.10.10.1
```

---

### âœ… Verification Commands:

```bash
Router# show ip route
Router# show ip protocols
Router# ping 192.168.10.x
Router# ping 192.168.20.x
```

---

## ğŸš¦ Static Routing Between Three Routers

### ğŸ”¹ Steps:

* Basic Configuration
* Assign IP Address to PC (via DHCP)
* Configure Static Routing
* Verify Static Routes

> à¦¨à¦¿à¦šà§‡à¦° à¦‰à¦¦à¦¾à¦¹à¦°à¦£à§‡ Router 0 â†” Router 1 â†” Router 2 à¦¸à¦‚à¦¯à§à¦•à§à¦¤à¥¤

---

## ğŸ› ï¸ Router 0

### ğŸ”§ Basic Configuration:

```bash
Router(config)# interface gig0/0
Router(config-if)# ip address 192.168.10.1 255.255.255.0
Router(config-if)# no shutdown

Router(config)# interface se0/1/0
Router(config-if)# ip address 100.10.10.1 255.255.255.0
Router(config-if)# no shutdown
```

### ğŸ–¥ï¸ DHCP:

```bash
Router(config)# ip dhcp pool IT
Router(dhcp-config)# network 192.168.10.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.10.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# exit
```

### ğŸ“ Static Routing:

```bash
Router(config)# ip route 192.168.30.0 255.255.255.0 100.10.10.2
```

---

## ğŸ› ï¸ Router 1

### ğŸ”§ Basic Configuration:

```bash
Router(config)# interface se0/0/0
Router(config-if)# ip address 100.10.10.2 255.255.255.0
Router(config-if)# no shutdown

Router(config)# interface se0/1/0
Router(config-if)# ip address 100.20.20.1 255.255.255.0
Router(config-if)# no shutdown
```

### ğŸ“ Static Routing:

```bash
Router(config)# ip route 192.168.10.0 255.255.255.0 100.10.10.1
Router(config)# ip route 192.168.30.0 255.255.255.0 100.20.20.2
```

---

## ğŸ› ï¸ Router 2

### ğŸ”§ Basic Configuration:

```bash
Router(config)# interface gig0/0
Router(config-if)# ip address 192.168.30.1 255.255.255.0
Router(config-if)# no shutdown

Router(config)# interface se0/0/0
Router(config-if)# ip address 100.20.20.2 255.255.255.0
Router(config-if)# no shutdown
```

### ğŸ–¥ï¸ DHCP:

```bash
Router(config)# ip dhcp pool HR
Router(dhcp-config)# network 192.168.30.0 255.255.255.0
Router(dhcp-config)# default-router 192.168.30.1
Router(dhcp-config)# dns-server 8.8.8.8
Router(dhcp-config)# exit
```

### ğŸ“ Static Routing:

```bash
Router(config)# ip route 192.168.10.0 255.255.255.0 100.20.20.1
```

---

### âœ… Verification Commands (For All Routers):

```bash
Router# show ip route
Router# show ip protocols
Router# ping [remote-network-IP]
```

---

> ğŸ” Make sure clock rate is set on DCE end of serial interface:

```bash
Router(config-if)# clock rate 64000
```
